Revit 2024 API
GeometryObject Members
The GeometryObject type exposes the following members.
Methods
Name | Description
Dispose
Causes the object to release immediately any resources it may be utilizing.
 (Inherited from APIObject.)
Equals
 Determines whether the specified Object is equal to the current Object.
 (Overrides Object.Equals(Object).)
GetHashCode
 Gets the integer value of the geometry object as hash code
 (Overrides Object.GetHashCode().)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Operators
Name | Description
Equality
Determines whether two GeometryObjects are the same.
Inequality
Determines whether two GeometryObjects are different.
Properties
Name | Description
GraphicsStyleId
The ElementId of the GeometryObject's GraphicsStyle
Id
A unique integer identifying the GeometryObject in its associated non view-specific GeometryElement.
IsElementGeometry
Indicates whether this geometry is obtained directly from an Element.
IsReadOnly
Identifies if the object is read-only or modifiable.
 (Inherited from APIObject.)
Visibility
The visibility.
See Also
GeometryObject Class
Autodesk.Revit.DB Namespace